In [1]:
%LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [2]:
ATTACH "../databases/covid19.db" AS covid19;

In [3]:
SELECT release_year,
       release_year = 1994 AS released_in_1994
  FROM movies
 LIMIT 10;

+--------------+------------------+
| release_year | released_in_1994 |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 1972         | 0                |
+--------------+------------------+
| 2008         | 0                |
+--------------+------------------+
| 1974         | 0                |
+--------------+------------------+
| 1957         | 0                |
+--------------+------------------+
| 1993         | 0                |
+--------------+------------------+
| 2003         | 0                |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 2001         | 0                |
+--------------+------------------+
| 1966         | 0                |
+--------------+------------------+
10 rows in set (0.00 sec)

In [4]:
SELECT release_year,
       release_year = 1994 AS released_in_1994
  FROM movies
 WHERE release_year = 1994;

+--------------+------------------+
| release_year | released_in_1994 |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
| 1994         | 1                |
+--------------+------------------+
5 rows in set (0.00 sec)

In [5]:
SELECT title,
       release_year,
       rating,
       runtime
  FROM movies
 WHERE release_year = 1994;

+--------------------------+--------------+--------+---------+
| title                    | release_year | rating | runtime |
+--------------------------+--------------+--------+---------+
| The Shawshank Redemption | 1994         | 9.3    | 142     |
+--------------------------+--------------+--------+---------+
| Pulp Fiction             | 1994         | 8.9    | 154     |
+--------------------------+--------------+--------+---------+
| Forrest Gump             | 1994         | 8.8    | 142     |
+--------------------------+--------------+--------+---------+
| Léon: The Professional  | 1994         | 8.5    | 110     |
+--------------------------+--------------+--------+---------+
| The Lion King            | 1994         | 8.5    | 88      |
+--------------------------+--------------+--------+---------+
5 rows in set (0.00 sec)

In [6]:
SELECT title,
       release_year,
       director
  FROM movies
 WHERE director = 'Christopher Nolan'
 ORDER BY release_year;

+-----------------------+--------------+-------------------+
| title                 | release_year | director          |
+-----------------------+--------------+-------------------+
| Memento               | 2000         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| Batman Begins         | 2005         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| The Prestige          | 2006         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| The Dark Knight       | 2008         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| Inception             | 2010         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| The Dark Knight Rises | 2012         | Christopher Nolan |
+-----------------------+--------------+-------------------+
| Interstellar          | 2014         | Christopher Nolan |
+-----------------------+--------------+-------------------+
7 rows in set (0.00 sec)

In [7]:
SELECT title
  FROM movies
 WHERE title LIKE 'The Lord of the Rings%'; -- The Lord of the Rings followed by any characters

+---------------------------------------------------+
| title                                             |
+---------------------------------------------------+
| The Lord of the Rings: The Return of the King     |
+---------------------------------------------------+
| The Lord of the Rings: The Fellowship of the Ring |
+---------------------------------------------------+
| The Lord of the Rings: The Two Towers             |
+---------------------------------------------------+
3 rows in set (0.00 sec)

In [8]:
SELECT title
  FROM movies
 WHERE title LIKE 'The ______'; -- The followed by a space and 6 characters

+------------+
| title      |
+------------+
| The Matrix |
+------------+
| The Father |
+------------+
2 rows in set (0.00 sec)

In [13]:
SELECT title
  FROM movies
 WHERE title LIKE '% king'; -- The Lord of the Rings followed by any characters

+-----------------------------------------------+
| title                                         |
+-----------------------------------------------+
| The Lord of the Rings: The Return of the King |
+-----------------------------------------------+
| The Lion King                                 |
+-----------------------------------------------+
2 rows in set (0.00 sec)

In [14]:
SELECT title
  FROM movies
 WHERE title LIKE '%king%'; -- The Lord of the Rings followed by any characters

+-----------------------------------------------+
| title                                         |
+-----------------------------------------------+
| The Lord of the Rings: The Return of the King |
+-----------------------------------------------+
| The Lion King                                 |
+-----------------------------------------------+
| To Kill a Mockingbird                         |
+-----------------------------------------------+
| Lock, Stock and Two Smoking Barrels           |
+-----------------------------------------------+
4 rows in set (0.00 sec)

In [21]:
SELECT 0 AND 0 AS False,
       0 AND 1 AS False,
       1 AND 0 AS False,
       1 AND 1 AS True;

+-------+-------+-------+------+
| False | False | False | True |
+-------+-------+-------+------+
| 0     | 0     | 0     | 1    |
+-------+-------+-------+------+
1 row in set (0.00 sec)

In [22]:
SELECT release_year >= 1990 AS condition_1,
       release_year <= 2010 AS condition_2,
       release_year >= 1990 AND release_year <= 2010 AS condtion_1_and_condition_2
  FROM movies
 LIMIT 5;

+-------------+-------------+----------------------------+
| condition_1 | condition_2 | condtion_1_and_condition_2 |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
5 rows in set (0.00 sec)

In [25]:
SELECT release_year,
       release_year BETWEEN 1990 AND 2010
  FROM movies
 LIMIT 5;

+--------------+------------------------------------+
| release_year | release_year BETWEEN 1990 AND 2010 |
+--------------+------------------------------------+
| 1994         | 1                                  |
+--------------+------------------------------------+
| 1972         | 0                                  |
+--------------+------------------------------------+
| 2008         | 1                                  |
+--------------+------------------------------------+
| 1974         | 0                                  |
+--------------+------------------------------------+
| 1957         | 0                                  |
+--------------+------------------------------------+
5 rows in set (0.00 sec)

In [26]:
SELECT release_year >= 1990 AS condition_1,
       release_year <= 2010 AS condition_2,
       release_year BETWEEN 1990 AND 2010 AS condtion_1_and_condition_2
  FROM movies
 LIMIT 5;

+-------------+-------------+----------------------------+
| condition_1 | condition_2 | condtion_1_and_condition_2 |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
5 rows in set (0.00 sec)

In [27]:
SELECT title,
       release_year
  FROM movies
 WHERE release_year BETWEEN 1990 AND 2010
 LIMIT 5;

+-----------------------------------------------+--------------+
| title                                         | release_year |
+-----------------------------------------------+--------------+
| The Shawshank Redemption                      | 1994         |
+-----------------------------------------------+--------------+
| The Dark Knight                               | 2008         |
+-----------------------------------------------+--------------+
| Schindler's List                              | 1993         |
+-----------------------------------------------+--------------+
| The Lord of the Rings: The Return of the King | 2003         |
+-----------------------------------------------+--------------+
| Pulp Fiction                                  | 1994         |
+-----------------------------------------------+--------------+
5 rows in set (0.00 sec)

In [28]:
SELECT 0 OR 0 AS False,
       0 OR 1 AS True,
       1 OR 0 AS True,
       1 OR 1 AS True;

+-------+------+------+------+
| False | True | True | True |
+-------+------+------+------+
| 0     | 1    | 1    | 1    |
+-------+------+------+------+
1 row in set (0.00 sec)

In [29]:
SELECT director = 'Steven Spielberg' AS condition_1,
       director = 'Christopher Nolan' AS condition_2,
       director = 'Steven Spielberg' OR director = 'Christopher Nolan' AS condtion_1_or_condition_2
  FROM movies
 LIMIT 10;

+-------------+-------------+---------------------------+
| condition_1 | condition_2 | condtion_1_or_condition_2 |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 1           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 1           | 0           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
10 rows in set (0.00 sec)

In [30]:
SELECT director = 'Steven Spielberg' AS condition_1,
       director = 'Christopher Nolan' AS condition_2,
       director IN ('Steven Spielberg', 'Christopher Nolan') AS condtion_1_or_condition_2
  FROM movies
 LIMIT 10;

+-------------+-------------+---------------------------+
| condition_1 | condition_2 | condtion_1_or_condition_2 |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 1           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 1           | 0           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
10 rows in set (0.00 sec)

In [35]:
SELECT release_year < 1990 AS condition_1,
       release_year > 2000 AS condition_2,
       1 IN (release_year< 1990, release_year> 2000) AS condtion_1_and_condition_2
  FROM movies
 LIMIT 5;

+-------------+-------------+----------------------------+
| condition_1 | condition_2 | condtion_1_and_condition_2 |
+-------------+-------------+----------------------------+
| 0           | 0           | 0                          |
+-------------+-------------+----------------------------+
| 1           | 0           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 1           | 0           | 1                          |
+-------------+-------------+----------------------------+
| 1           | 0           | 1                          |
+-------------+-------------+----------------------------+
5 rows in set (0.00 sec)

In [36]:
SELECT title,
       director
  FROM movies
 WHERE director IN ('Steven Spielberg', 'Christopher Nolan')
 LIMIT 5;

+---------------------+-------------------+
| title               | director          |
+---------------------+-------------------+
| The Dark Knight     | Christopher Nolan |
+---------------------+-------------------+
| Schindler's List    | Steven Spielberg  |
+---------------------+-------------------+
| Inception           | Christopher Nolan |
+---------------------+-------------------+
| Saving Private Ryan | Steven Spielberg  |
+---------------------+-------------------+
| Interstellar        | Christopher Nolan |
+---------------------+-------------------+
5 rows in set (0.00 sec)

In [37]:
SELECT NOT 1 AS False,
       NOT 0 AS True;

+-------+------+
| False | True |
+-------+------+
| 0     | 1    |
+-------+------+
1 row in set (0.00 sec)

In [38]:
SELECT title,
       director
  FROM movies
 WHERE director NOT IN ('Steven Spielberg', 'Christopher Nolan') -- preferred
 LIMIT 5;

+-----------------------------------------------+----------------------+
| title                                         | director             |
+-----------------------------------------------+----------------------+
| The Shawshank Redemption                      | Frank Darabont       |
+-----------------------------------------------+----------------------+
| The Godfather                                 | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| The Godfather Part II                         | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| 12 Angry Men                                  | Sidney Lumet         |
+-----------------------------------------------+----------------------+
| The Lord of the Rings: The Return of the King | Peter Jackson        |
+-----------------------------------------------+----------------------+
5 rows in set (0.00 sec)

In [39]:
SELECT title,
       director
  FROM movies
 WHERE NOT director IN ('Steven Spielberg', 'Christopher Nolan')
 LIMIT 5;

+-----------------------------------------------+----------------------+
| title                                         | director             |
+-----------------------------------------------+----------------------+
| The Shawshank Redemption                      | Frank Darabont       |
+-----------------------------------------------+----------------------+
| The Godfather                                 | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| The Godfather Part II                         | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| 12 Angry Men                                  | Sidney Lumet         |
+-----------------------------------------------+----------------------+
| The Lord of the Rings: The Return of the King | Peter Jackson        |
+-----------------------------------------------+----------------------+
5 rows in set (0.00 sec)

In [40]:
SELECT NULL = NULL AS null_value,
       NULL != NULL AS null_value,
       NULL IS NULL AS True,
       NULL IS NOT NULL AS False;

+------------+------------+------+-------+
| null_value | null_value | True | False |
+------------+------------+------+-------+
| NULL       | NULL       | 1    | 0     |
+------------+------------+------+-------+
1 row in set (0.00 sec)

In [41]:
SELECT Province_State,
       Admin2,
       Province_State = NULL AS Province_State_equals_to_null,
       Admin2 != NULL AS Admin2_not_equals_to_null
  FROM lookup_table
 LIMIT 5;

+----------------+--------+-------------------------------+---------------------------+
| Province_State | Admin2 | Province_State_equals_to_null | Admin2_not_equals_to_null |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| American Samoa | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
5 rows in set (0.00 sec)

In [42]:
SELECT Province_State,
       Admin2,
       Province_State IS NULL AS Province_State_is_null,
       Admin2 IS NOT NULL AS Admin2_is_not_null
  FROM lookup_table
 LIMIT 5;

+----------------+--------+------------------------+--------------------+
| Province_State | Admin2 | Province_State_is_null | Admin2_is_not_null |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| American Samoa | NULL   | 0                      | 0                  |
+----------------+--------+------------------------+--------------------+
5 rows in set (0.00 sec)

In [44]:
SELECT 
       NOT Admin2 IS NULL AS Admin2_is_not_null
  FROM lookup_table
 LIMIT 5;

+--------------------+
| Admin2_is_not_null |
+--------------------+
| 0                  |
+--------------------+
| 0                  |
+--------------------+
| 0                  |
+--------------------+
| 0                  |
+--------------------+
| 0                  |
+--------------------+
5 rows in set (0.00 sec)

In [45]:
SELECT Province_State,
       Admin2
  FROM lookup_table
 WHERE Province_State IS NOT NULL AND
       Admin2 IS NOT NULL
 LIMIT 5;

+--------------------------------+--------------+
| Province_State                 | Admin2       |
+--------------------------------+--------------+
| Sint Eustatius and Saba        | Bonaire      |
+--------------------------------+--------------+
| Ascension and Tristan da Cunha | Saint Helena |
+--------------------------------+--------------+
| Puerto Rico                    | Adjuntas     |
+--------------------------------+--------------+
| Puerto Rico                    | Aguada       |
+--------------------------------+--------------+
| Puerto Rico                    | Aguadilla    |
+--------------------------------+--------------+
5 rows in set (0.00 sec)

# Exercise

In [47]:
SELECT Country_Region,
       Date,
       Confirmed,
       Daily_Cases
  FROM covid19.time_series
 WHERE Country_Region = 'Taiwan'
 LIMIT 5;

+----------------+------------+-----------+-------------+
| Country_Region | Date       | Confirmed | Daily_Cases |
+----------------+------------+-----------+-------------+
| Taiwan         | 2020-01-22 | 1         | 1           |
+----------------+------------+-----------+-------------+
| Taiwan         | 2020-01-23 | 1         | 0           |
+----------------+------------+-----------+-------------+
| Taiwan         | 2020-01-24 | 3         | 2           |
+----------------+------------+-----------+-------------+
| Taiwan         | 2020-01-25 | 3         | 0           |
+----------------+------------+-----------+-------------+
| Taiwan         | 2020-01-26 | 4         | 1           |
+----------------+------------+-----------+-------------+
5 rows in set (0.00 sec)

In [51]:
SELECT title,
       rating,
       director,
       runtime
  FROM movies
 WHERE release_year = 1994;

+--------------------------+--------+-------------------+---------+
| title                    | rating | director          | runtime |
+--------------------------+--------+-------------------+---------+
| The Shawshank Redemption | 9.3    | Frank Darabont    | 142     |
+--------------------------+--------+-------------------+---------+
| Pulp Fiction             | 8.9    | Quentin Tarantino | 154     |
+--------------------------+--------+-------------------+---------+
| Forrest Gump             | 8.8    | Robert Zemeckis   | 142     |
+--------------------------+--------+-------------------+---------+
| Léon: The Professional  | 8.5    | Luc Besson        | 110     |
+--------------------------+--------+-------------------+---------+
| The Lion King            | 8.5    | Roger Allers      | 88      |
+--------------------------+--------+-------------------+---------+
5 rows in set (0.00 sec)

In [54]:
SELECT id,
       name
  FROM actors
 WHERE name IN ('Tom Hanks', 'Christian Bale', 'Leonardo DiCaprio' );

+------+-------------------+
| id   | name              |
+------+-------------------+
| 518  | Christian Bale    |
+------+-------------------+
| 1860 | Leonardo DiCaprio |
+------+-------------------+
| 2957 | Tom Hanks         |
+------+-------------------+
3 rows in set (0.00 sec)

In [55]:
SELECT *
  FROM actors
 WHERE name IN ('Tom Hanks', 'Christian Bale', 'Leonardo DiCaprio');

+------+-------------------+
| id   | name              |
+------+-------------------+
| 518  | Christian Bale    |
+------+-------------------+
| 1860 | Leonardo DiCaprio |
+------+-------------------+
| 2957 | Tom Hanks         |
+------+-------------------+
3 rows in set (0.00 sec)

In [57]:
SELECT title,
       director
  FROM movies
 WHERE director in ('Christopher Nolan', 'Peter Jackson')
 ORDER BY director;

+---------------------------------------------------+-------------------+
| title                                             | director          |
+---------------------------------------------------+-------------------+
| The Dark Knight                                   | Christopher Nolan |
+---------------------------------------------------+-------------------+
| Inception                                         | Christopher Nolan |
+---------------------------------------------------+-------------------+
| Interstellar                                      | Christopher Nolan |
+---------------------------------------------------+-------------------+
| The Prestige                                      | Christopher Nolan |
+---------------------------------------------------+-------------------+
| Memento                                           | Christopher Nolan |
+---------------------------------------------------+-------------------+
| The Dark Knight Rises                             | Christopher Nolan |
+---------------------------------------------------+-------------------+
| Batman Begins                                     | Christopher Nolan |
+---------------------------------------------------+-------------------+
| The Lord of the Rings: The Return of the King     | Peter Jackson     |
+---------------------------------------------------+-------------------+
| The Lord of the Rings: The Fellowship of the Ring | Peter Jackson     |
+---------------------------------------------------+-------------------+
| The Lord of the Rings: The Two Towers             | Peter Jackson     |
+---------------------------------------------------+-------------------+
10 rows in set (0.00 sec)

In [59]:
SELECT DISTINCT Country_Region
  FROM covid19.lookup_table 
 WHERE Country_Region LIKE '%land%';

+------------------+
| Country_Region   |
+------------------+
| Solomon Islands  |
+------------------+
| New Zealand      |
+------------------+
| Finland          |
+------------------+
| Iceland          |
+------------------+
| Ireland          |
+------------------+
| Netherlands      |
+------------------+
| Marshall Islands |
+------------------+
| Poland           |
+------------------+
| Switzerland      |
+------------------+
| Thailand         |
+------------------+
10 rows in set (0.00 sec)